FV2610/E_0250.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.3 | 23.06.2026 (urspr. 01.04.2026) | ebdamame v1.0.0 | rebdhuhn v1.2.0
endfooter

title
MaBiS

7.76.1: AD: Messlokationsänderung vom LF an MSB



end title
:<b>E_0250</b>;
note right
<b><i>Prüfende Rolle: MSB
end note

if (<b>10: </b> Ist der LF der Marktlokation der genannten Lokation im gewünschten Umsetzungszeitraum zugeordnet?) then (ja)
else (nein)
    if (<b>20: </b> Liegt dem MSB eine Vollmacht des Letztverbrauchers bzw. Erzeugers vor?) then (ja)
    else (nein)
        :A03;
        note left
            Cluster: Ablehnung
            Vollmacht des Letztverbrauchers bzw. Erzeugers liegt nicht vor.
        endnote
        kill;
    endif
    if (<b>30: </b> Ist die Vollmacht plausibel und gültig?) then (ja)
    else (nein)
        :A04;
        note left
            Cluster: Ablehnung
            Vollmacht ist nicht plausibel und gültig.
        endnote
        kill;
    endif
    if (<b>40: </b> Liegt das gewünschte Änderungsdatum mindestens 20 WT nach dem Nachrichteneingangsdatum?) then (ja)
        :A02;
        note left
            Cluster: Zustimmung
            Änderung kann durchgeführt werden.
        endnote
        kill;
    else (nein)
        :A01;
        note left
            Cluster: Ablehnung
            Frist nicht eingehalten
        endnote
        kill;
    endif
endif
if (<b>40: </b> Liegt das gewünschte Änderungsdatum mindestens 20 WT nach dem Nachrichteneingangsdatum?) then (ja)
    :A02;
    note left
        Cluster: Zustimmung
        Änderung kann durchgeführt werden.
    endnote
    kill;
else (nein)
    :A01;
    note left
        Cluster: Ablehnung
        Frist nicht eingehalten
    endnote
    kill;
endif

@enduml
